SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32F0050/MM32F0050_Application/Device/MM32F0050/Include/reg_gpio.h
/***********************************************************************************************************************
    @file     reg_gpio.h
    @author   VV TEAM
    @brief    This flie contains all the GPIO's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_GPIO_H
#define __REG_GPIO_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include <core_cm0.h>



/**
  * @brief GPIO Base Address Definition
  */
#define  GPIOA_BASE                                0x48000000                                       /*!<Base Address: 0x48000000*/
#define  GPIOB_BASE                                0x48000400                                       /*!<Base Address: 0x48000400*/
#define  GPIOC_BASE                                0x48000800                                       /*!<Base Address: 0x48000800*/
#define  GPIOD_BASE                                0x48000C00                                       /*!<Base Address: 0x48000C00*/

/**
  * @brief GPIO Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CRL;                            /*!<GPIO Port configuration register low           offset: 0x00       */
    __IO uint32_t CRH;                            /*!<GPIO Port configuration register high          offset: 0x04       */
    __IO uint32_t IDR;                            /*!<GPIO Port input data register                  offset: 0x08       */
    __IO uint32_t ODR;                            /*!<GPIO Port output data register                 offset: 0x0C       */
    __IO uint32_t BSRR;                           /*!<GPIO Port bit set/reset register               offset: 0x10       */
    __IO uint32_t BRR;                            /*!<GPIO Port bit reset register                   offset: 0x14       */
    __IO uint32_t LCKR;                           /*!<GPIO Port configuration lock register          offset: 0x18       */
    __IO uint32_t DCR;                            /*!<GPIO Port output open drain control register   offset: 0x1C       */
    __IO uint32_t AFRL;                           /*!<GPIO Port alternate function register low      offset: 0x20       */
    __IO uint32_t AFRH;                           /*!<GPIO Port alternate function register high     offset: 0x24       */
} GPIO_TypeDef;

/**
  * @brief GPIO type pointer Definition
  */
#define GPIOA                                     ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB                                     ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC                                     ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD                                     ((GPIO_TypeDef *)GPIOD_BASE)

/**
  * @brief GPIO_CRL Register Bit Definition
  */
#define  GPIO_CRL_MODE0_Pos                       (0)
#define  GPIO_CRL_MODE0_Msk                       (0x3U << GPIO_CRL_MODE0_Pos)                      /*!<See MODE15*/
#define  GPIO_CRL_MODE0                           GPIO_CRL_MODE0_Msk
#define  GPIO_CRL_MODE0_0                         (0x1U << GPIO_CRL_MODE0_Pos) 
#define  GPIO_CRL_MODE0_1                         (0x2U << GPIO_CRL_MODE0_Pos) 
#define  GPIO_CRL_CNF0_Pos                        (2)
#define  GPIO_CRL_CNF0_Msk                        (0x3U << GPIO_CRL_CNF0_Pos)                       /*!<See CNF15*/
#define  GPIO_CRL_CNF0                            GPIO_CRL_CNF0_Msk
#define  GPIO_CRL_CNF0_0                          (0x1U << GPIO_CRL_CNF0_Pos) 
#define  GPIO_CRL_CNF0_1                          (0x2U << GPIO_CRL_CNF0_Pos) 
#define  GPIO_CRL_MODE1_Pos                       (4)
#define  GPIO_CRL_MODE1_Msk                       (0x3U << GPIO_CRL_MODE1_Pos)                      /*!<See MODE15*/
#define  GPIO_CRL_MODE1                           GPIO_CRL_MODE1_Msk
#define  GPIO_CRL_MODE1_0                         (0x1U << GPIO_CRL_MODE1_Pos) 
#define  GPIO_CRL_MODE1_1                         (0x2U << GPIO_CRL_MODE1_Pos) 
#define  GPIO_CRL_CNF1_Pos                        (6)
#define  GPIO_CRL_CNF1_Msk                        (0x3U << GPIO_CRL_CNF1_Pos)                       /*!<See CNF15*/
#define  GPIO_CRL_CNF1                            GPIO_CRL_CNF1_Msk
#define  GPIO_CRL_CNF1_0                          (0x1U << GPIO_CRL_CNF1_Pos) 
#define  GPIO_CRL_CNF1_1                          (0x2U << GPIO_CRL_CNF1_Pos) 
#define  GPIO_CRL_MODE2_Pos                       (8)
#define  GPIO_CRL_MODE2_Msk                       (0x3U << GPIO_CRL_MODE2_Pos)                      /*!<See MODE15*/
#define  GPIO_CRL_MODE2                           GPIO_CRL_MODE2_Msk
#define  GPIO_CRL_MODE2_0                         (0x1U << GPIO_CRL_MODE2_Pos) 
#define  GPIO_CRL_MODE2_1                         (0x2U << GPIO_CRL_MODE2_Pos) 
#define  GPIO_CRL_CNF2_Pos                        (10)
#define  GPIO_CRL_CNF2_Msk                        (0x3U << GPIO_CRL_CNF2_Pos)                       /*!<See CNF15*/
#define  GPIO_CRL_CNF2                            GPIO_CRL_CNF2_Msk
#define  GPIO_CRL_CNF2_0                          (0x1U << GPIO_CRL_CNF2_Pos) 
#define  GPIO_CRL_CNF2_1                          (0x2U << GPIO_CRL_CNF2_Pos) 
#define  GPIO_CRL_MODE3_Pos                       (12)
#define  GPIO_CRL_MODE3_Msk                       (0x3U << GPIO_CRL_MODE3_Pos)                      /*!<See MODE15*/
#define  GPIO_CRL_MODE3                           GPIO_CRL_MODE3_Msk
#define  GPIO_CRL_MODE3_0                         (0x1U << GPIO_CRL_MODE3_Pos) 
#define  GPIO_CRL_MODE3_1                         (0x2U << GPIO_CRL_MODE3_Pos) 
#define  GPIO_CRL_CNF3_Pos                        (14)
#define  GPIO_CRL_CNF3_Msk                        (0x3U << GPIO_CRL_CNF3_Pos)                       /*!<See CNF15*/
#define  GPIO_CRL_CNF3                            GPIO_CRL_CNF3_Msk
#define  GPIO_CRL_CNF3_0                          (0x1U << GPIO_CRL_CNF3_Pos) 
#define  GPIO_CRL_CNF3_1                          (0x2U << GPIO_CRL_CNF3_Pos) 
#define  GPIO_CRL_MODE4_Pos                       (16)
#define  GPIO_CRL_MODE4_Msk                       (0x3U << GPIO_CRL_MODE4_Pos)                      /*!<See MODE15*/
#define  GPIO_CRL_MODE4                           GPIO_CRL_MODE4_Msk
#define  GPIO_CRL_MODE4_0                         (0x1U << GPIO_CRL_MODE4_Pos) 
#define  GPIO_CRL_MODE4_1                         (0x2U << GPIO_CRL_MODE4_Pos) 
#define  GPIO_CRL_CNF4_Pos                        (18)
#define  GPIO_CRL_CNF4_Msk                        (0x3U << GPIO_CRL_CNF4_Pos)                       /*!<See CNF15*/
#define  GPIO_CRL_CNF4                            GPIO_CRL_CNF4_Msk
#define  GPIO_CRL_CNF4_0                          (0x1U << GPIO_CRL_CNF4_Pos) 
#define  GPIO_CRL_CNF4_1                          (0x2U << GPIO_CRL_CNF4_Pos) 
#define  GPIO_CRL_MODE5_Pos                       (20)
#define  GPIO_CRL_MODE5_Msk                       (0x3U << GPIO_CRL_MODE5_Pos)                      /*!<See MODE15*/
#define  GPIO_CRL_MODE5                           GPIO_CRL_MODE5_Msk
#define  GPIO_CRL_MODE5_0                         (0x1U << GPIO_CRL_MODE5_Pos) 
#define  GPIO_CRL_MODE5_1                         (0x2U << GPIO_CRL_MODE5_Pos) 
#define  GPIO_CRL_CNF5_Pos                        (22)
#define  GPIO_CRL_CNF5_Msk                        (0x3U << GPIO_CRL_CNF5_Pos)                       /*!<See CNF15*/
#define  GPIO_CRL_CNF5                            GPIO_CRL_CNF5_Msk
#define  GPIO_CRL_CNF5_0                          (0x1U << GPIO_CRL_CNF5_Pos) 
#define  GPIO_CRL_CNF5_1                          (0x2U << GPIO_CRL_CNF5_Pos) 
#define  GPIO_CRL_MODE6_Pos                       (24)
#define  GPIO_CRL_MODE6_Msk                       (0x3U << GPIO_CRL_MODE6_Pos)                      /*!<See MODE15*/
#define  GPIO_CRL_MODE6                           GPIO_CRL_MODE6_Msk
#define  GPIO_CRL_MODE6_0                         (0x1U << GPIO_CRL_MODE6_Pos) 
#define  GPIO_CRL_MODE6_1                         (0x2U << GPIO_CRL_MODE6_Pos) 
#define  GPIO_CRL_CNF6_Pos                        (26)
#define  GPIO_CRL_CNF6_Msk                        (0x3U << GPIO_CRL_CNF6_Pos)                       /*!<See CNF15*/
#define  GPIO_CRL_CNF6                            GPIO_CRL_CNF6_Msk
#define  GPIO_CRL_CNF6_0                          (0x1U << GPIO_CRL_CNF6_Pos) 
#define  GPIO_CRL_CNF6_1                          (0x2U << GPIO_CRL_CNF6_Pos) 
#define  GPIO_CRL_MODE7_Pos                       (28)
#define  GPIO_CRL_MODE7_Msk                       (0x3U << GPIO_CRL_MODE7_Pos)                      /*!<Port input/output configuration (MODEy)(y = 0..7)*/
#define  GPIO_CRL_MODE7                           GPIO_CRL_MODE7_Msk
#define  GPIO_CRL_MODE7_0                         (0x1U << GPIO_CRL_MODE7_Pos) 
#define  GPIO_CRL_MODE7_1                         (0x2U << GPIO_CRL_MODE7_Pos) 
#define  GPIO_CRL_CNF7_Pos                        (30)
#define  GPIO_CRL_CNF7_Msk                        (0x3U << GPIO_CRL_CNF7_Pos)                       /*!<Port configuration bits (y=7..0)*/
#define  GPIO_CRL_CNF7                            GPIO_CRL_CNF7_Msk
#define  GPIO_CRL_CNF7_0                          (0x1U << GPIO_CRL_CNF7_Pos) 
#define  GPIO_CRL_CNF7_1                          (0x2U << GPIO_CRL_CNF7_Pos) 

/**
  * @brief GPIO_CRH Register Bit Definition
  */
#define  GPIO_CRH_MODE8_Pos                       (0)
#define  GPIO_CRH_MODE8_Msk                       (0x3U << GPIO_CRH_MODE8_Pos)                      /*!<See MODE15*/
#define  GPIO_CRH_MODE8                           GPIO_CRH_MODE8_Msk
#define  GPIO_CRH_MODE8_0                         (0x1U << GPIO_CRH_MODE8_Pos) 
#define  GPIO_CRH_MODE8_1                         (0x2U << GPIO_CRH_MODE8_Pos) 
#define  GPIO_CRH_CNF8_Pos                        (2)
#define  GPIO_CRH_CNF8_Msk                        (0x3U << GPIO_CRH_CNF8_Pos)                       /*!<See CNF15*/
#define  GPIO_CRH_CNF8                            GPIO_CRH_CNF8_Msk
#define  GPIO_CRH_CNF8_0                          (0x1U << GPIO_CRH_CNF8_Pos) 
#define  GPIO_CRH_CNF8_1                          (0x2U << GPIO_CRH_CNF8_Pos) 
#define  GPIO_CRH_MODE9_Pos                       (4)
#define  GPIO_CRH_MODE9_Msk                       (0x3U << GPIO_CRH_MODE9_Pos)                      /*!<See MODE15*/
#define  GPIO_CRH_MODE9                           GPIO_CRH_MODE9_Msk
#define  GPIO_CRH_MODE9_0                         (0x1U << GPIO_CRH_MODE9_Pos) 
#define  GPIO_CRH_MODE9_1                         (0x2U << GPIO_CRH_MODE9_Pos) 
#define  GPIO_CRH_CNF9_Pos                        (6)
#define  GPIO_CRH_CNF9_Msk                        (0x3U << GPIO_CRH_CNF9_Pos)                       /*!<See CNF15*/
#define  GPIO_CRH_CNF9                            GPIO_CRH_CNF9_Msk
#define  GPIO_CRH_CNF9_0                          (0x1U << GPIO_CRH_CNF9_Pos) 
#define  GPIO_CRH_CNF9_1                          (0x2U << GPIO_CRH_CNF9_Pos) 
#define  GPIO_CRH_MODE10_Pos                      (8)
#define  GPIO_CRH_MODE10_Msk                      (0x3U << GPIO_CRH_MODE10_Pos)                     /*!<See MODE15*/
#define  GPIO_CRH_MODE10                          GPIO_CRH_MODE10_Msk
#define  GPIO_CRH_MODE10_0                        (0x1U << GPIO_CRH_MODE10_Pos) 
#define  GPIO_CRH_MODE10_1                        (0x2U << GPIO_CRH_MODE10_Pos) 
#define  GPIO_CRH_CNF10_Pos                       (10)
#define  GPIO_CRH_CNF10_Msk                       (0x3U << GPIO_CRH_CNF10_Pos)                      /*!<See CNF15*/
#define  GPIO_CRH_CNF10                           GPIO_CRH_CNF10_Msk
#define  GPIO_CRH_CNF10_0                         (0x1U << GPIO_CRH_CNF10_Pos) 
#define  GPIO_CRH_CNF10_1                         (0x2U << GPIO_CRH_CNF10_Pos) 
#define  GPIO_CRH_MODE11_Pos                      (12)
#define  GPIO_CRH_MODE11_Msk                      (0x3U << GPIO_CRH_MODE11_Pos)                     /*!<See MODE15*/
#define  GPIO_CRH_MODE11                          GPIO_CRH_MODE11_Msk
#define  GPIO_CRH_MODE11_0                        (0x1U << GPIO_CRH_MODE11_Pos) 
#define  GPIO_CRH_MODE11_1                        (0x2U << GPIO_CRH_MODE11_Pos) 
#define  GPIO_CRH_CNF11_Pos                       (14)
#define  GPIO_CRH_CNF11_Msk                       (0x3U << GPIO_CRH_CNF11_Pos)                      /*!<See CNF15*/
#define  GPIO_CRH_CNF11                           GPIO_CRH_CNF11_Msk
#define  GPIO_CRH_CNF11_0                         (0x1U << GPIO_CRH_CNF11_Pos) 
#define  GPIO_CRH_CNF11_1                         (0x2U << GPIO_CRH_CNF11_Pos) 
#define  GPIO_CRH_MODE12_Pos                      (16)
#define  GPIO_CRH_MODE12_Msk                      (0x3U << GPIO_CRH_MODE12_Pos)                     /*!<See MODE15*/
#define  GPIO_CRH_MODE12                          GPIO_CRH_MODE12_Msk
#define  GPIO_CRH_MODE12_0                        (0x1U << GPIO_CRH_MODE12_Pos) 
#define  GPIO_CRH_MODE12_1                        (0x2U << GPIO_CRH_MODE12_Pos) 
#define  GPIO_CRH_CNF12_Pos                       (18)
#define  GPIO_CRH_CNF12_Msk                       (0x3U << GPIO_CRH_CNF12_Pos)                      /*!<See CNF15*/
#define  GPIO_CRH_CNF12                           GPIO_CRH_CNF12_Msk
#define  GPIO_CRH_CNF12_0                         (0x1U << GPIO_CRH_CNF12_Pos) 
#define  GPIO_CRH_CNF12_1                         (0x2U << GPIO_CRH_CNF12_Pos) 
#define  GPIO_CRH_MODE13_Pos                      (20)
#define  GPIO_CRH_MODE13_Msk                      (0x3U << GPIO_CRH_MODE13_Pos)                     /*!<See MODE15*/
#define  GPIO_CRH_MODE13                          GPIO_CRH_MODE13_Msk
#define  GPIO_CRH_MODE13_0                        (0x1U << GPIO_CRH_MODE13_Pos) 
#define  GPIO_CRH_MODE13_1                        (0x2U << GPIO_CRH_MODE13_Pos) 
#define  GPIO_CRH_CNF13_Pos                       (22)
#define  GPIO_CRH_CNF13_Msk                       (0x3U << GPIO_CRH_CNF13_Pos)                      /*!<See CNF15*/
#define  GPIO_CRH_CNF13                           GPIO_CRH_CNF13_Msk
#define  GPIO_CRH_CNF13_0                         (0x1U << GPIO_CRH_CNF13_Pos) 
#define  GPIO_CRH_CNF13_1                         (0x2U << GPIO_CRH_CNF13_Pos) 
#define  GPIO_CRH_MODE14_Pos                      (24)
#define  GPIO_CRH_MODE14_Msk                      (0x3U << GPIO_CRH_MODE14_Pos)                     /*!<See MODE15*/
#define  GPIO_CRH_MODE14                          GPIO_CRH_MODE14_Msk
#define  GPIO_CRH_MODE14_0                        (0x1U << GPIO_CRH_MODE14_Pos) 
#define  GPIO_CRH_MODE14_1                        (0x2U << GPIO_CRH_MODE14_Pos) 
#define  GPIO_CRH_CNF14_Pos                       (26)
#define  GPIO_CRH_CNF14_Msk                       (0x3U << GPIO_CRH_CNF14_Pos)                      /*!<See CNF15*/
#define  GPIO_CRH_CNF14                           GPIO_CRH_CNF14_Msk
#define  GPIO_CRH_CNF14_0                         (0x1U << GPIO_CRH_CNF14_Pos) 
#define  GPIO_CRH_CNF14_1                         (0x2U << GPIO_CRH_CNF14_Pos) 
#define  GPIO_CRH_MODE15_Pos                      (28)
#define  GPIO_CRH_MODE15_Msk                      (0x3U << GPIO_CRH_MODE15_Pos)                     /*!<Set MODEy to 0 and port to input mode*/
#define  GPIO_CRH_MODE15                          GPIO_CRH_MODE15_Msk
#define  GPIO_CRH_MODE15_0                        (0x1U << GPIO_CRH_MODE15_Pos) 
#define  GPIO_CRH_MODE15_1                        (0x2U << GPIO_CRH_MODE15_Pos) 
#define  GPIO_CRH_CNF15_Pos                       (30)
#define  GPIO_CRH_CNF15_Msk                       (0x3U << GPIO_CRH_CNF15_Pos)                      /*!<Port configuration bits (y=7..0)*/
#define  GPIO_CRH_CNF15                           GPIO_CRH_CNF15_Msk
#define  GPIO_CRH_CNF15_0                         (0x1U << GPIO_CRH_CNF15_Pos) 
#define  GPIO_CRH_CNF15_1                         (0x2U << GPIO_CRH_CNF15_Pos) 

/**
  * @brief GPIO_IDR Register Bit Definition
  */
#define  GPIO_IDR_IDR0_Pos                        (0)
#define  GPIO_IDR_IDR0_Msk                        (0x1U << GPIO_IDR_IDR0_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR0                            GPIO_IDR_IDR0_Msk
#define  GPIO_IDR_IDR1_Pos                        (1)
#define  GPIO_IDR_IDR1_Msk                        (0x1U << GPIO_IDR_IDR1_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR1                            GPIO_IDR_IDR1_Msk
#define  GPIO_IDR_IDR2_Pos                        (2)
#define  GPIO_IDR_IDR2_Msk                        (0x1U << GPIO_IDR_IDR2_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR2                            GPIO_IDR_IDR2_Msk
#define  GPIO_IDR_IDR3_Pos                        (3)
#define  GPIO_IDR_IDR3_Msk                        (0x1U << GPIO_IDR_IDR3_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR3                            GPIO_IDR_IDR3_Msk
#define  GPIO_IDR_IDR4_Pos                        (4)
#define  GPIO_IDR_IDR4_Msk                        (0x1U << GPIO_IDR_IDR4_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR4                            GPIO_IDR_IDR4_Msk
#define  GPIO_IDR_IDR5_Pos                        (5)
#define  GPIO_IDR_IDR5_Msk                        (0x1U << GPIO_IDR_IDR5_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR5                            GPIO_IDR_IDR5_Msk
#define  GPIO_IDR_IDR6_Pos                        (6)
#define  GPIO_IDR_IDR6_Msk                        (0x1U << GPIO_IDR_IDR6_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR6                            GPIO_IDR_IDR6_Msk
#define  GPIO_IDR_IDR7_Pos                        (7)
#define  GPIO_IDR_IDR7_Msk                        (0x1U << GPIO_IDR_IDR7_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR7                            GPIO_IDR_IDR7_Msk
#define  GPIO_IDR_IDR8_Pos                        (8)
#define  GPIO_IDR_IDR8_Msk                        (0x1U << GPIO_IDR_IDR8_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR8                            GPIO_IDR_IDR8_Msk
#define  GPIO_IDR_IDR9_Pos                        (9)
#define  GPIO_IDR_IDR9_Msk                        (0x1U << GPIO_IDR_IDR9_Pos)                       /*!<Port input data*/
#define  GPIO_IDR_IDR9                            GPIO_IDR_IDR9_Msk
#define  GPIO_IDR_IDR10_Pos                       (10)
#define  GPIO_IDR_IDR10_Msk                       (0x1U << GPIO_IDR_IDR10_Pos)                      /*!<Port input data*/
#define  GPIO_IDR_IDR10                           GPIO_IDR_IDR10_Msk
#define  GPIO_IDR_IDR11_Pos                       (11)
#define  GPIO_IDR_IDR11_Msk                       (0x1U << GPIO_IDR_IDR11_Pos)                      /*!<Port input data*/
#define  GPIO_IDR_IDR11                           GPIO_IDR_IDR11_Msk
#define  GPIO_IDR_IDR12_Pos                       (12)
#define  GPIO_IDR_IDR12_Msk                       (0x1U << GPIO_IDR_IDR12_Pos)                      /*!<Port input data*/
#define  GPIO_IDR_IDR12                           GPIO_IDR_IDR12_Msk
#define  GPIO_IDR_IDR13_Pos                       (13)
#define  GPIO_IDR_IDR13_Msk                       (0x1U << GPIO_IDR_IDR13_Pos)                      /*!<Port input data*/
#define  GPIO_IDR_IDR13                           GPIO_IDR_IDR13_Msk
#define  GPIO_IDR_IDR14_Pos                       (14)
#define  GPIO_IDR_IDR14_Msk                       (0x1U << GPIO_IDR_IDR14_Pos)                      /*!<Port input data*/
#define  GPIO_IDR_IDR14                           GPIO_IDR_IDR14_Msk
#define  GPIO_IDR_IDR15_Pos                       (15)
#define  GPIO_IDR_IDR15_Msk                       (0x1U << GPIO_IDR_IDR15_Pos)                      /*!<Port input data*/
#define  GPIO_IDR_IDR15                           GPIO_IDR_IDR15_Msk

